<a href="https://colab.research.google.com/github/BhagyaMihi/Bootcamp_project1/blob/main/Bootcamp_project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [146]:
import pandas as pd
import numpy as np

**Read the first five lines of the dataset**

In [147]:
df = pd.DataFrame(pd.read_csv('/content/train.csv'))
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [148]:
df.shape #size of the data set; number of the rows and the number of the columns

(891, 12)

**Handeling NULL values**

In [149]:
df.isnull().sum()#Get the sum of null values in each column

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**Seperate the columns which have more than 35% of the missing values in the data set**

In [150]:
n = df.isnull().sum()
drop_col = n[n>35/100 * df.shape[0]]
drop_col.index

Index(['Cabin'], dtype='object')

In [151]:
df.drop(drop_col.index, axis=1, inplace=True) #drop the column which had more than 35% of the missing values in the data set
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

**Fill the null values with appropriate value**

In [152]:
df.fillna(df.mean(), inplace=True)#fill null values with the mean value
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

**Get description of a column**

In [153]:
df['Embarked'].describe() #get description of the column Embarked as it is only column left with null values

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

**Fill NULL values in the column with the top value **

In [154]:
df.fillna('s', inplace=True)

**Correlation**

In [155]:
df.corr() #correlation among all the data columns

             PassengerId  Survived    Pclass  ...     SibSp     Parch      Fare
PassengerId     1.000000 -0.005007 -0.035144  ... -0.057527 -0.001652  0.012658
Survived       -0.005007  1.000000 -0.338481  ... -0.035322  0.081629  0.257307
Pclass         -0.035144 -0.338481  1.000000  ...  0.083081  0.018443 -0.549500
Age             0.033207 -0.069809 -0.331339  ... -0.232625 -0.179191  0.091566
SibSp          -0.057527 -0.035322  0.083081  ...  1.000000  0.414838  0.159651
Parch          -0.001652  0.081629  0.018443  ...  0.414838  1.000000  0.216225
Fare            0.012658  0.257307 -0.549500  ...  0.159651  0.216225  1.000000

[7 rows x 7 columns]



*   Fare and Pclass has the highest correlation

**Create new column**

In [156]:
df['Family'] = df['SibSp']+df['Parch']
df.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Family
0            1         0       3  ...   7.2500        S       1
1            2         1       1  ...  71.2833        C       1
2            3         1       3  ...   7.9250        S       0
3            4         1       1  ...  53.1000        S       1
4            5         0       3  ...   8.0500        S       0

[5 rows x 12 columns]

In [157]:
df.drop(['SibSp','Parch'], axis=1, inplace=True)#drop the SibSp and Parch columns
df.head()

   PassengerId  Survived  Pclass  ...     Fare Embarked  Family
0            1         0       3  ...   7.2500        S       1
1            2         1       1  ...  71.2833        C       1
2            3         1       3  ...   7.9250        S       0
3            4         1       1  ...  53.1000        S       1
4            5         0       3  ...   8.0500        S       0

[5 rows x 10 columns]

**Check for being alone can effect the survival**

In [158]:
df['Alone'] = [0 if df['Family'][i]>0 else 1 for i in df.index]
df['Sex'] = [0 if df['Sex'][i]=='male' else 1 for i in df.index]#if the passenger is male value is 0 and if female value is 1
df.head()

   PassengerId  Survived  Pclass  ... Embarked  Family  Alone
0            1         0       3  ...        S       1      0
1            2         1       1  ...        C       1      0
2            3         1       3  ...        S       0      1
3            4         1       1  ...        S       1      0
4            5         0       3  ...        S       0      1

[5 rows x 11 columns]

In [159]:
df.groupby(['Embarked'])['Survived'].mean()

Embarked
C    0.553571
Q    0.389610
S    0.336957
s    1.000000
Name: Survived, dtype: float64

In [160]:
df.groupby(['Alone'])['Survived'].mean()

Alone
0    0.505650
1    0.303538
Name: Survived, dtype: float64

In [161]:
df.groupby(['Sex'])['Survived'].mean()

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [162]:
df.groupby(['Pclass'])['Survived'].mean()

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64


*  Female passengers have more chance to survive then the male passengers
*  Passengers in higher classes has a great chance to survived

**Correlation between diffrent columns**

In [163]:
df[['Alone', 'Fare']].corr() #correlation between Alone and the Fare of the passenger

          Alone      Fare
Alone  1.000000 -0.271832
Fare  -0.271832  1.000000

In [164]:
df[['Alone', 'Age']].corr() #correlation between Alone and the Age of the passenger

          Alone       Age
Alone  1.000000  0.179775
Age    0.179775  1.000000

In [165]:
df[['Pclass', 'Survived']].corr() #correlation between Pclass and the Survived of the passenger

            Pclass  Survived
Pclass    1.000000 -0.338481
Survived -0.338481  1.000000



*   Pclass and Survived has a great correlation

**Conclusion**

*   Fare and Pclass has the highest correlation
*   Female passengers have more chance to survive then the male passengers
*   Passengers in higher classes has a great chance to survived
*   Pclass and Survived has a great correlation
*   Passengers who have a family are more likely to survive than the passengers who are travelling alone
*   Passengers whose embarked is C are more likely to survive